jenkins/b_reporting.yml
---
modules:
  blazemeter:
    token: 3e777ceb0863a9700800

reporting:
  - module: blazemeter
    test: Taurus Demo B
  - module: junit-xml
    filename: ./junit.xml
    data-source: pass-fail
  - module: fail-criteria
    criterias:
      - avg-rt>6000ms for 10s, continue as failed
      - avg-rt>5s for 1m, continue as failed
      - avg-rt of Confirmation>5s for 30s, continue as failed

execution:
  scenario:
    script: ./jenkins/_blazedemo_v3.jmx
  concurrency: 100
  ramp-up: 180s
  hold-for: 120s